//=============================================================================
//
// 弾 [CreateField.h]
// Author : SAWAMURA RYUTO
// 開発履歴：12/20	二次元配列を用いた、マップ構築
//
//=============================================================================
#pragma once

#include "main.h"


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitCField(void);
void UninitCField(void);
void UpdateCField(void);
void DrawCField(void);