//**************************************************************
//
//	Gate.h
//	ゲームシーン開始時のゲートの処理
//
//--------------------------------------------------------------
//	製作者：柴山凜太郎
//--------------------------------------------------------------
//**************************************************************

//**************************************************************
//	開発履歴
//	2021/12/21	ゲートの作成開始
//	編集者：柴山凜太郎
//**************************************************************
#pragma once

//**************************************************************
// インクルード部
//**************************************************************
#include "main.h"
#include < string >

//**************************************************************
// 構造体定義
//**************************************************************
struct TGATE {
	XMFLOAT3	pos;		// 現在の位置
	XMFLOAT4X4	mtxWorld;	// ワールドマトリックス
	std::string	model3D;	// モデル情報
	bool		use;		// 使用しているか
	bool		invincible;// 無敵かどうか　ON：無敵
};

//**************************************************************
// マクロ定義
//**************************************************************
#define BLOCK_X			(25)	// ブロック最大数X
#define BLOCK_Y			(25)	// ブロック最大数Y
#define MAX_BLOCK		(BLOCK_X * BLOCK_Y)	// ブロック最大数

//**************************************************************
// プロトタイプ宣言
//**************************************************************
HRESULT InitGate(void);		// 初期化
void UninitGate(void);		// 終了
void UpdateGate(void);		// 更新
void DrawGate(void);		// 描画

int SetGate(XMFLOAT3 pos);	// ゲート配置
XMFLOAT3 GetGateSize();		// ゲート取得
TGATE* GetGateArray();		// ゲート配列取得