//**************************************************************
//
//	Block.h
//	ブロック処理
//
//--------------------------------------------------------------
//	製作者：上月大地
//--------------------------------------------------------------
//**************************************************************

#pragma once

//**************************************************************
// インクルード部
//**************************************************************
 #include "main.h"
#include < string >

//**************************************************************
// 列挙体宣言
//**************************************************************
enum MODEL
{
	BLOCK_NORMAL,		// 通常ブロック
	BLOCK_CRACKS,		// ひび割れブロック
	BLOCK_INVINCIBLE,	// 無敵ブロック


	MAX_BLOCK_TYPE		// 使うモデルの最大数
};

//**************************************************************
// 構造体定義
//**************************************************************
struct TBLOCK {
	XMFLOAT3	m_pos;		// 現在の位置
	XMFLOAT3    m_size;		// 現在のサイズ
	XMFLOAT3    m_Halfsize;		// ハーフサイズ
	XMFLOAT4X4	m_mtxWorld;	// ワールドマトリックス
	//std::string	m_3Dmodel;	// モデル情報
	int			m_nLife;	// 壁の耐久値
	bool		m_use;		// 使用しているか
	//bool		cracks;		// 使用しているか
	//MODEL		state;			// ブロックの状態
	bool		m_invincible;// 無敵かどうか　ON：無敵
};

//**************************************************************
// マクロ定義
//**************************************************************
#define BLOCK_X			(25)	// ブロック最大数X
#define BLOCK_Y			(25)	// ブロック最大数Y
#define MAX_BLOCK		(BLOCK_X * BLOCK_Y)	// ブロック最大数

//**************************************************************
// プロトタイプ宣言
//**************************************************************
HRESULT InitBlock(void);
void UninitBlock(void);
void UpdateBlock(void);
void DrawBlock(void);

int SetBlock(XMFLOAT3 pos, bool inv, XMFLOAT2 size, XMFLOAT2 cpos);	// ブロック配置 
XMFLOAT3 GetBlockSize();	// ブロックサイズ取得
TBLOCK* GetBlockArray();	// ブロック配列取得
