#ifndef __COUNTENEMY_H__
#define __COUNTENEMY_H__
//**************************************************************
//
//	CountEnemy.h
//	エネミー数える君
//
//--------------------------------------------------------------
//	製作者：小嶋悟
//--------------------------------------------------------------
//**************************************************************

//**************************************************************
// インクルード部
//**************************************************************
#include "main.h"
//**************************************************************
// 関数プロトタイプ
//**************************************************************
HRESULT InitCountEnemy(); // 初期化
void UninitCountEnemy(); // 終了処理
void UpdateCountEnemy(); // 更新
void DrawCountEnemy(); // 描画
void AddCountEnemy(int nCount = 1);
void DelCountEnemy(int nCount = 1);
int GetCountEnemy();
#endif // !__COUNTENEMY_H__