//**************************************************************
//
//	CreateField.h
//	マップ生成
//
//--------------------------------------------------------------
//	製作者：澤村瑠人
//--------------------------------------------------------------
//**************************************************************

//**************************************************************
//	開発履歴
//	2021/12/20	二次元配列を用いた、マップ構築
//				生成範囲は未実装
//	編集者：澤村瑠人
//--------------------------------------------------------------
//	2021/12/22	コメントの編集&追加
//--------------------------------------------------------------
//	2021/12/28	列挙体を作ることによって
//--------------------------------------------------------------
//	2022/12/06　クラス化を行いました
//				それに従って変数名関数名も変更を加えました
//	編集者：柴山凜太郎
//**************************************************************
#pragma once
//**************************************************************
// インクルード部
//**************************************************************
#include "main.h"

//**************************************************************
// マクロ定義
//**************************************************************

enum STAGE
{
	STAGE_NONE = 0,
	//AREA_DEBUG = 0,	// デバッグエリア

	STAGE_1,			// ステージ１
	STAGE_2,			// ステージ２
	STAGE_3,			// ステージ３
	STAGE_4,			// ステージ４
	STAGE_5,			// ステージ５
	STAGE_6,			// ステージ６
	STAGE_7,			// ステージ７
	STAGE_8,			// ステージ８
	STAGE_9,			// ステージ９
	STAGE_10,			// ステージ１０

	MAX_STAGE			// エリアの最大数
};

#define MAP_WIDTH  (25)		// マップ横のセル数
#define MAP_HEIGHT (25)		// マップ縦のセル数

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CEnemyMelee;
class CEnemyRange;
class CStage
{
public:
	CStage();
	~CStage();


	HRESULT Init(STAGE Stage);	// 初期化
	void Uninit(void);			// 終了
	void Update(void);			// 更新
	void Draw(void);				// 描画
private:
	// ステージ構築用のデータ配列
	int m_nMap[MAX_STAGE][MAP_WIDTH][MAP_HEIGHT];
	static XMFLOAT3 m_fMapPosOrizin;	// マップ生成開始座標
	STAGE eStage;		// エリア切り替え用変数

	CEnemyMelee* m_EnemyMelee;
	CEnemyRange* m_EnemyRange;
public:
	STAGE GetState();		// 現在のステージの取得
};
