//**************************************************************
//
//	Fade.h
//	フェード処理ヘッダ
//
//--------------------------------------------------------------
//	製作者：上月大地
//--------------------------------------------------------------
//**************************************************************

#pragma once

//**************************************************************
// インクルード部
//**************************************************************
#include "main.h"
#include "SceneManager.h"

//**************************************************************
// 列挙体宣言
//**************************************************************

// シーン状態
enum E_FADE_STATE
{
	FADE_NONE = 0,		// 何もしていない
	FADE_IN,			// フェードイン
	FADE_OUT,			// フェードアウト

	MAX_FADE
};

// テクスチャ
typedef enum {
	
	LOAD = 0,		// Now Loadingテクスチャ
	LOGO,			// キャラ顔テクスチャ

	FADE_TEX_MAX	// 最大数
} FADE_TEX;

//**************************************************************
// プロトタイプ宣言
//**************************************************************
HRESULT InitFade(); // 初期化
void UninitFade();	// 終了処理
void UpdateFade();	// 更新
void DrawFade();	// 描画

// フェードアウト開始
void StartFadeOut(int eNext);

//フェード状態取得
E_FADE_STATE GetFadeState();

