//**************************************************************
//
//	SceneGame.h
//	ゲームシーンのヘッダ
//
//--------------------------------------------------------------
//	製作者：上月大地
//--------------------------------------------------------------
//**************************************************************

//**************************************************************
//	開発履歴
//	2021/12/06	小嶋悟君のプログラムを元に作成	
//	編集者：??
//	2021/12/28	CreateField.hのインクルード
//				初期化の引数にエリア切り替え用の引数追加
//	編集者：柴山凜太郎
//**************************************************************
#pragma once

//**************************************************************
// インクルード部
//**************************************************************
#include "main.h"
#include "CreateStage.h"
#include "player.h"


//**************************************************************
// プロトタイプ宣言
//**************************************************************
class CSceneGame
{
public:
	CSceneGame();
	~CSceneGame();

	virtual HRESULT Init(STAGE Stage); // 初期化
	virtual void Uninit();	// 終了処理
	virtual void Update();	// 更新
	virtual void Draw();	// 描画


private:
	//本来はPlayerやEnemyを除いたものは別cppなどでまとめて一括で呼びたい
	CPlayer* m_Player;
	CStage* m_Stage;

};
